PinguinoIDE/pinguino-compilers/win32/p8/share/gputils/header/p18f43k22.inc
C12IN0N          EQU  H'0000'
C12IN1N          EQU  H'0001'
VREFM            EQU  H'0002'
VREFP            EQU  H'0003'
T0CKI            EQU  H'0004'
SS               EQU  H'0005'

VREFN            EQU  H'0002'
SRQ              EQU  H'0004'
NOT_SS           EQU  H'0005'

CVREF            EQU  H'0002'
LVDIN            EQU  H'0005'

DACOUT           EQU  H'0002'
HLVDIN           EQU  H'0005'

SS1              EQU  H'0005'

NOT_SS1          EQU  H'0005'

SRNQ             EQU  H'0005'


;----- PORTB Bits -----------------------------------------------------
RB0              EQU  H'0000'
RB1              EQU  H'0001'
RB2              EQU  H'0002'
RB3              EQU  H'0003'
RB4              EQU  H'0004'
RB5              EQU  H'0005'
RB6              EQU  H'0006'
RB7              EQU  H'0007'

INT0             EQU  H'0000'
INT1             EQU  H'0001'
INT2             EQU  H'0002'
CCP2_PORTB       EQU  H'0003'
KBI0             EQU  H'0004'
KBI1             EQU  H'0005'
KBI2             EQU  H'0006'
KBI3             EQU  H'0007'

AN12             EQU  H'0000'
AN10             EQU  H'0001'
AN8              EQU  H'0002'
AN9              EQU  H'0003'
AN11             EQU  H'0004'
AN13             EQU  H'0005'
PGC              EQU  H'0006'
PGD              EQU  H'0007'

FLT0             EQU  H'0000'
C12IN3M          EQU  H'0001'
C12IN2M          EQU  H'0003'
T5G              EQU  H'0004'
T1G              EQU  H'0005'

SRI              EQU  H'0000'
C12IN3N          EQU  H'0001'
C12IN2N          EQU  H'0003'
CCP3_PORTB       EQU  H'0005'

CTED1            EQU  H'0002'
CTED2            EQU  H'0003'
T3CKI_PORTB      EQU  H'0005'

P2A_PORTB        EQU  H'0003'
P3A_PORTB        EQU  H'0005'


;----- PORTC Bits -----------------------------------------------------
RC0              EQU  H'0000'
RC1              EQU  H'0001'
RC2              EQU  H'0002'
RC3              EQU  H'0003'
RC4              EQU  H'0004'
RC5              EQU  H'0005'
RC6              EQU  H'0006'
RC7              EQU  H'0007'

T1OSO            EQU  H'0000'
T1OSI            EQU  H'0001'
T5CKI            EQU  H'0002'
SCK              EQU  H'0003'
SDI              EQU  H'0004'
SDO              EQU  H'0005'
TX               EQU  H'0006'
RX               EQU  H'0007'

P2B_PORTC        EQU  H'0000'
P2A_PORTC        EQU  H'0001'
P1A              EQU  H'0002'
SCL              EQU  H'0003'
SDA              EQU  H'0004'
CK               EQU  H'0006'
; DT is a reserved word
; DT               EQU  H'0007'

T1CKI            EQU  H'0000'
CCP2_PORTC       EQU  H'0001'
CCP1             EQU  H'0002'
SCK1             EQU  H'0003'
SDI1             EQU  H'0004'
SDO1             EQU  H'0005'
TX1              EQU  H'0006'
RX1              EQU  H'0007'

T3CKI_PORTC      EQU  H'0000'
CTPLS            EQU  H'0002'
SCL1             EQU  H'0003'
SDA1             EQU  H'0004'
CK1              EQU  H'0006'
DT1              EQU  H'0007'

T3G              EQU  H'0000'
AN14             EQU  H'0002'
AN15             EQU  H'0003'
AN16             EQU  H'0004'
AN17             EQU  H'0005'
AN18             EQU  H'0006'
AN19             EQU  H'0007'


;----- PORTD Bits -----------------------------------------------------
RD0              EQU  H'0000'
RD1              EQU  H'0001'
RD2              EQU  H'0002'
RD3              EQU  H'0003'
RD4              EQU  H'0004'
RD5              EQU  H'0005'
RD6              EQU  H'0006'
RD7              EQU  H'0007'

P2B_PORTD        EQU  H'0002'
P2C              EQU  H'0003'
P2D              EQU  H'0004'
P1B              EQU  H'0005'
P1C              EQU  H'0006'
P1D              EQU  H'0007'

CCP4             EQU  H'0001'
TX2              EQU  H'0006'
RX2              EQU  H'0007'

SCK2             EQU  H'0000'
SDI2             EQU  H'0001'
NOT_SS2          EQU  H'0003'
SDO2             EQU  H'0004'
CK2              EQU  H'0006'
DT2              EQU  H'0007'

SCL2             EQU  H'0000'
SDA2             EQU  H'0001'
SS2              EQU  H'0003'

AN20             EQU  H'0000'
AN21             EQU  H'0001'
AN22             EQU  H'0002'
AN23             EQU  H'0003'
AN24             EQU  H'0004'
AN25             EQU  H'0005'
AN26             EQU  H'0006'
AN27             EQU  H'0007'


;----- PORTE Bits -----------------------------------------------------
RE0              EQU  H'0000'
RE1              EQU  H'0001'
RE2              EQU  H'0002'
RE3              EQU  H'0003'

AN5              EQU  H'0000'
AN6              EQU  H'0001'
AN7              EQU  H'0002'
MCLR             EQU  H'0003'

P3A_PORTE        EQU  H'0000'
P3B              EQU  H'0001'
CCP5             EQU  H'0002'
NOT_MCLR         EQU  H'0003'

CCP3_PORTE       EQU  H'0000'
VPP              EQU  H'0003'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA3            EQU  H'0003'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'
LATA6            EQU  H'0006'
LATA7            EQU  H'0007'


;----- LATB Bits -----------------------------------------------------
LATB0            EQU  H'0000'
LATB1            EQU  H'0001'
LATB2            EQU  H'0002'
LATB3            EQU  H'0003'
LATB4            EQU  H'0004'
LATB5            EQU  H'0005'
LATB6            EQU  H'0006'
LATB7            EQU  H'0007'


;----- LATC Bits -----------------------------------------------------
LATC0            EQU  H'0000'
LATC1            EQU  H'0001'
LATC2            EQU  H'0002'
LATC3            EQU  H'0003'
LATC4            EQU  H'0004'
LATC5            EQU  H'0005'
LATC6            EQU  H'0006'
LATC7            EQU  H'0007'


;----- LATD Bits -----------------------------------------------------
LATD0            EQU  H'0000'
LATD1            EQU  H'0001'
LATD2            EQU  H'0002'
LATD3            EQU  H'0003'
LATD4            EQU  H'0004'
LATD5            EQU  H'0005'
LATD6            EQU  H'0006'
LATD7            EQU  H'0007'


;----- LATE Bits -----------------------------------------------------
LATE0            EQU  H'0000'
LATE1            EQU  H'0001'
LATE2            EQU  H'0002'


